Revit 2027 API
SpecTypeId.SectionProperty Property
 Section Property, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SectionProperty { get; }
Public Shared ReadOnly Property SectionProperty As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SectionProperty {
	ForgeTypeId^ get ();
}
static member SectionProperty : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace